snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыКодировокШК/ТипыКодировокШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодировокШК</name>
  <enumValues>
    <name>PDF417</name>
  </enumValues>
  <enumValues>
    <name>DataMatrix</name>
  </enumValues>
  <enumValues>
    <name>ITF14</name>
  </enumValues>
  <enumValues>
    <name>EAN8</name>
  </enumValues>
  <enumValues>
    <name>EAN13</name>
  </enumValues>
  <enumValues>
    <name>Code39</name>
  </enumValues>
  <enumValues>
    <name>Code128</name>
  </enumValues>
  <enumValues>
    <name>SSCC</name>
  </enumValues>
  <enumValues>
    <name>GS1_DataBarExpandedStacked</name>
  </enumValues>
  <enumValues>
    <name>GS1_128</name>
  </enumValues>
  <enumValues>
    <name>QR</name>
  </enumValues>
  <enumValues>
    <name>GS1_DataMatrix</name>
  </enumValues>
  <enumValues>
    <name>Неопределен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СпособыВводаВОборотСУЗ/СпособыВводаВОборотСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВводаВОборотСУЗ</name>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВРФ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ObjectModule.bsl
#Область СобытияОбъекта


Процедура ПередЗаписью(Отказ)
	ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи", Истина);
	
	Если ОбменДанными.Загрузка Тогда
		Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.Склад И ЗначениеЗаполнено(ОбменДанными.Отправитель) Тогда
			Если ТипКода = Перечисления.ТипыКодовМаркировки.ЛогистическаяУпаковка
				И СоставКоробкиЗаполнен(Ссылка) Тогда
				Отказ = Истина; //Коробку могли собрать уже - не надо от греха ее трогать 			
			КонецЕсли; 		
		КонецЕсли;
		
		ВидОперации = МаркировкаКС.ПолучитьЗначениеПараметра(ДополнительныеСвойства, "ВидОперации");
		Если ВидОперации <> Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	Если ТипКода = Перечисления.ТипыКодовМаркировки.Товар Тогда
		Наименование 		= Справочники.ШтрихкодыУпаковокТоваров.СформироватьНаименованиеШкGS1(ЗначениеШтрихкода);
		
		Если КодировкаШтрихкода.Пустая() Тогда
			КодировкаШтрихкода = Перечисления.ТипыКодировокШК.GS1_DataMatrix;		
		КонецЕсли;
	Иначе
		Если КодировкаШтрихкода.Пустая() Тогда
			КодировкаШтрихкода = Перечисления.ТипыКодировокШК.GS1_128;
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка И ЗначениеЗаполнено(ОбменДанными.Отправитель) Тогда Возврат КонецЕсли;
	
	Отказ = НЕ ШтрихКодУникален();
	
	Если НЕ Отказ Тогда
		Если СпособВводаВОборот <> Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда	//Импортные лучше с агрегацией отправить - от греха подальше
			локУстановитьСписокПолучателей();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

Функция локУстановитьСписокПолучателей()	
	ИмяПланаОбмена	= "ДанныеЧЗ";
	Получатели		= Новый Массив;
	
	Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Для Каждого УзелПолучатель Из Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.Склад, ИмяПланаОбмена) Цикл
			Получатели.Добавить(УзелПолучатель);
		КонецЦикла;
	Иначе
	//	рШапки = ПолучитьРеквизитыШапки(Ссылка, "ТипУпаковки,СпособВводаВОборот");
	//	Если (рШапки.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка
	//		ИЛИ рШапки.ТипУпаковки = Перечисления.ТипыУпаковок.МультитоварнаяУпаковка) 
	//		И рШапки.СпособВводаВОборот <> Перечисления.СпособыВводаВОборотСУЗ.Импорт 
	//		И ВложенныеШтрихкоды.Количество() > 0 Тогда
	//		Для Каждого УзелПолучатель Из Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.УправляющееПодразделение, ИмяПланаОбмена) Цикл
	//			Получатели.Добавить(УзелПолучатель);			
	//		КонецЦикла;										
	//	КонецЕсли;
	КонецЕсли;
	
	Для Каждого Получатель Из Получатели Цикл
		Если Получатель <> Маркировка_ПИ.ЭтотУзел(ИмяПланаОбмена) Тогда
			ОбменДанными.Получатели.Добавить(Получатель);				
		КонецЕсли;	
	КонецЦикла;
КонецФункции // ()

Функция ШтрихКодУникален()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ	
	|	ЗначениеШтрихкода = &ЗначениеШтрихкода
	|	И Ссылка <> &Ссылка
	|";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", ЗначениеШтрихкода);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат НЕ (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка));
КонецФункции //ШтрихКодУникален()

Функция СоставКоробкиЗаполнен(ШтрихкодКоробки)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1 
	|	Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды
	|ГДЕ
	|	Ссылка = &ШтрихкодКоробки
	|";
	Запрос.УстановитьПараметр("ШтрихкодКоробки", ШтрихкодКоробки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка));
КонецФункции //СоставКоробкиЗаполнен(Коробка)
